In [4]:
%load_ext sql
import pandas as pd
import sqlite3

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [5]:
%sql sqlite:///CourseDataWarehouse.db 
conn = sqlite3.connect('CourseDataWarehouse.db')

## Check For Entity Integirty

In [6]:
%%sql
-- Record Counts for Class Meetings
SELECT 
    (SELECT Count(*) FROM CLASSMEETINGS) as 'RawCount',
    (SELECT Count(*) FROM (SELECT DISTINCT * FROM CLASSMEETINGS)) as 'DistinctCount';

 * sqlite:///CourseDataWarehouse.db
Done.

[(16289, 16289)]

In [7]:
%%sql
-- Record Counts for Class Terms
SELECT 
    (SELECT Count(*) FROM CLASSTERMS) as 'RawCount',
    (SELECT Count(*) FROM (SELECT DISTINCT * FROM CLASSTERMS)) as 'DistinctCount';

 * sqlite:///CourseDataWarehouse.db
Done.

[(19, 19)]

In [8]:
%%sql
-- Record Counts for Time Codes
SELECT 
    (SELECT Count(*) FROM Time_Codes) as 'RawCount',
    (SELECT Count(*) FROM (SELECT DISTINCT * FROM Time_Codes)) as 'DistinctCount';

 * sqlite:///CourseDataWarehouse.db
Done.

[(272215, 272215)]

In [9]:
%%sql
-- Record Counts for Class Locations
SELECT 
    (SELECT Count(*) FROM CLASSLOCATIONS) as 'RawCount',
    (SELECT Count(*) FROM (SELECT DISTINCT * FROM CLASSLOCATIONS)) as 'DistinctCount';

 * sqlite:///CourseDataWarehouse.db
Done.

[(207, 207)]

In [10]:
%%sql
-- Record Counts for Class Instructors
SELECT 
    (SELECT Count(*) FROM CLASSINSTRUCTORS) as 'RawCount',
    (SELECT Count(*) FROM (SELECT DISTINCT * FROM CLASSINSTRUCTORS)) as 'DistinctCount';

 * sqlite:///CourseDataWarehouse.db
Done.

[(1095, 1095)]

In [11]:
%%sql
-- Record Counts for Class Programs
SELECT 
    (SELECT Count(*) FROM CLASSPROGRAMS) as 'RawCount',
    (SELECT Count(*) FROM (SELECT DISTINCT * FROM CLASSPROGRAMS)) as 'DistinctCount';

 * sqlite:///CourseDataWarehouse.db
Done.

[(83, 83)]

## Check For Relational Integrity

In [22]:
%%sql
SELECT DISTINCT cm.crn, cm.location_code, cm.program_code, cm.catalog_id, cm.title, i.instructor_name, cp.program_name, tc.day, tc.time_codes, cl.building, ct.term
FROM CLASSMEETINGS cm
JOIN CLASSPROGRAMS cp USING (program_code)
JOIN CLASSINSTRUCTORS i USING (instructor_id)
JOIN TIME_CODES tc USING(time_codes)
JOIN CLASSLOCATIONS cl USING(location_code)
JOIN CLASSTERMS ct USING(term)
LIMIT 10;

 * sqlite:///CourseDataWarehouse.db
Done.

[(70384, 'DSB 105', 'AC', 'AC 0011', 'Introduction to Financial Accounting', 'Michael P.  Coyne', 'Accounting', 'F', "['TF 0800am-0915am 09/02-12/08 DSB 105']", 'DSB', 'Fall2014'),
 (70384, 'DSB 105', 'AC', 'AC 0011', 'Introduction to Financial Accounting', 'Michael P.  Coyne', 'Accounting', 'T', "['TF 0800am-0915am 09/02-12/08 DSB 105']", 'DSB', 'Fall2014'),
 (70385, 'DSB 105', 'AC', 'AC 0011', 'Introduction to Financial Accounting', 'Michael P.  Coyne', 'Accounting', 'F', "['TF 0930am-1045am 09/02-12/08 DSB 105']", 'DSB', 'Fall2014'),
 (70385, 'DSB 105', 'AC', 'AC 0011', 'Introduction to Financial Accounting', 'Michael P.  Coyne', 'Accounting', 'T', "['TF 0930am-1045am 09/02-12/08 DSB 105']", 'DSB', 'Fall2014'),
 (70382, 'DSB 105', 'AC', 'AC 0011', 'Introduction to Financial Accounting', 'Michael P.  Coyne', 'Accounting', 'F', "['TF 1230pm-0145pm 09/02-12/08 DSB 105']", 'DSB', 'Fall2014'),
 (70382, 'DSB 105', 'AC', 'AC 0011', 'Introduction to Financial Accounting', 'Michael P.  Coyne', 'Accounting', 'T', "['TF 1230pm-0145pm 09/02-12/08 DSB 105']", 'DSB', 'Fall2014'),
 (70291, 'DSB 111', 'AC', 'AC 0011', 'Introduction to Financial Accounting', 'Rebecca I.  Bloch', 'Accounting', 'M', "['MR 1100am-1215pm 09/02-12/08 DSB 111']", 'DSB', 'Fall2014'),
 (70291, 'DSB 111', 'AC', 'AC 0011', 'Introduction to Financial Accounting', 'Rebecca I.  Bloch', 'Accounting', 'R', "['MR 1100am-1215pm 09/02-12/08 DSB 111']", 'DSB', 'Fall2014'),
 (70350, 'DSB 111', 'AC', 'AC 0011', 'Introduction to Financial Accounting', 'Rebecca I.  Bloch', 'Accounting', 'M', "['MR 1230pm-0145pm 09/02-12/08 DSB 111']", 'DSB', 'Fall2014'),
 (70350, 'DSB 111', 'AC', 'AC 0011', 'Introduction to Financial Accounting', 'Rebecca I.  Bloch', 'Accounting', 'R', "['MR 1230pm-0145pm 09/02-12/08 DSB 111']", 'DSB', 'Fall2014')]

 * sqlite:///CourseDataWarehouse.db
Done.

[(1, 'Fall2014'),
 (2, 'Fall2015'),
 (3, 'Fall2016'),
 (4, 'Fall2017'),
 (5, 'Fall2018'),
 (6, 'Spring2015'),
 (7, 'Spring2016'),
 (8, 'Spring2017'),
 (9, 'Spring2018'),
 (10, 'Spring2019'),
 (11, 'SpringBreak2017'),
 (12, 'Summer2015'),
 (13, 'Summer2016'),
 (14, 'Summer2017'),
 (15, 'Summer2018'),
 (16, 'Winter2015'),
 (17, 'Winter2016'),
 (18, 'Winter2017'),
 (19, 'Winter2018')]